<template>
  <div class="about">
    <h2>Кастомизированный компонент Vue2CollapseButton</h2>
    <div>Пока отсутствует</div>

    <h2>Кастомизированный Bootstrap компонент BS46CollapseButton</h2>
    <div class="section">
      <vb-alert theme-color="warning"
        >Работает исправно. Используется в проектах 40,61,62,64,71,72. Проекты
        61 и 64 имеют устаревшую версию без отслеживания события "click"
        Используется в паре с BS46Collapse. Эти два компонента не объединены в
        один по причине необходимости размещения кнопки отдельно от панели.
        Необходимо использовать стандартный компонент кнопки (пока не
        реализован)</vb-alert
      >
      <h3>Описание</h3>
      <div>Назначение: ...</div>
      <div>...</div>
      <h3>Варианты использования</h3>
      <h3>Типовое представление</h3>
      <h3>Действия компонента</h3>
      <pre>
props: {
  // подзаголовок
  поле: тип,
},
        </pre
      >
    </div>
  </div>
</template>

<script>
export default {
  name: "CollapseButtonView",
  data() {
    return {};
  },
  methods: {},
};
</script>
