<template>
  <div class="about">
    <h2>Кастомизированный компонент Vue2Filter</h2>
    <div>Пока отсутствует</div>

    <h2>Кастомизированный Bootstrap компонент BS46Filter</h2>
    <div class="section">
      <vb-alert theme-color="warning"
        >Работает ... Используется в проектах ...</vb-alert
      >
      <h3>Описание</h3>
      <div>Назначение: Фильтрация списков.</div>
      <div>
        Принимает... Работает аналогично компоненту BS46Form. С компонентом
        должны использоваться методы изменения формы, применения фильтрации и
        сброса полей формы. Для этого у полей формы должно быть поле
        defaultValue, к значению которого будет приводиться значение
        соответствующего поля при сбросе. Фильтр может иметь поле с именем
        метода, который будет применяться при применении фильтрации и её сбросе.
        Для более удобного формирования запроса метода поля фильтра должны иметь
        поле name. Фильтр опционно имеет кнопку свертывания. Опционно может быть
        выключен блок кнопок "Применить" и "Сбросить". Фильтр должен иметь поле,
        по которому сортируются записи, а также поле с направлением сортировки.
        Желательно в макете иметь селект с выбором колонки для сортировки и поле
        изменения направления сортировки. Кнопки сортировки должны опционально
        отключаться.
      </div>
      <pre>
props: {
  // подзаголовок
  поле: тип,
},
        </pre
      >
      <h3>Варианты использования</h3>
      <h3>Действия компонента</h3>
    </div>
  </div>
</template>

<script>
import VbAlert from "../components/Bootstrap_4.6.2/BS46Alert";
export default {
  name: "FilterView",
  components: { VbAlert },
};
</script>

<style scoped></style>
