<template>
  <div>
    <div class="home">Стартовая страница</div>
    <div>
      Цель проекта - создание переиспользкемой библиотеки компонентов для
      ускорения создания проектов. В качестве точки отсчета принят фреймворк
      bootstrap. Планируется достижение гибкости за счет использования других
      фреймфорков переключением пропса framework. Желательно создание
      npm-пакета. Легкость конечного продукта должна быть достигнута за счет
      инкапсуляции стилей и скриптов внутри компонентов
    </div>
  </div>
</template>

<script>
export default {
  name: "HomeView",
};
</script>
